
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда

		ДокОснование = ДанныеЗаполнения.ПолучитьОбъект();

		Основание = ДокОснование.Ссылка;
		Ответственный = ДокОснование.Ответственный;
		Комментарий = ДокОснование.Комментарий;
		Организация = ДокОснование.Организация;
		Контрагент = ДокОснование.Контрагент;
		Договор = ДокОснование.Договор;

		Для Каждого ТекСтрокаТовары Из ДокОснование.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
		КонецЦикла;
	Иначе
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли