
//++ СтудентНетология Зозуля Т.В. 31.01.2026
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
// Добавляет элементы формы
//
// Параметры:
// Форма - ФормаКлиентскогоПриложения - форма, в которой добавляются элементы
Процедура ДобавлениеЭлементовФормы(Форма) Экспорт

	ИмяФормы = Форма.ИмяФормы;

	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		ДобавитьПолеСогласованнаяСкидкаВГруппаШапкаЛево(Форма);
		ДобавитьКнопкуПересчитать(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	КонецЕсли;

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Добавляет поле КонтактноеЛицо в группу ШапкаПраво формы.
Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
	
	Если Форма.Элементы.Найти("ГруппаШапкаПраво") = Неопределено Тогда
		ПолеВводаКЛ = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
	Иначе
		ПолеВводаКЛ = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	КонецЕсли;
	ПолеВводаКЛ.ПутьКДанным = "Объект.КонтактноеЛицо";
	ПолеВводаКЛ.Вид = ВидПоляФормы.ПолеВвода;

КонецПроцедуры

//++Добавление Согласованной скидки в группу ШапкаЛево
Процедура ДобавитьПолеСогласованнаяСкидкаВГруппаШапкаЛево(Форма)

	ГруппаПересчета = Форма.Элементы.Вставить("ГруппаПересчетСуммыСоСкидкой", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	ГруппаПересчета.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПересчета.ОтображатьЗаголовок = Ложь;
	ГруппаПересчета.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ПолеВводаСкидка = Форма.Элементы.Вставить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаПересчетСуммыСоСкидкой);
	ПолеВводаСкидка.ПутьКДанным = "Объект.СогласованнаяСкидка";
	ПолеВводаСкидка.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВводаСкидка.УстановитьДействие("ПриИзменении", "Подключаемый_ДЗ11_2СогласованнаяСкидкаПриИзменении"); 
	
КонецПроцедуры

// Добавляет кнопку Пересчитать Согласованная скидка в группу ШапкаЛево формы
Процедура ДобавитьКнопкуПересчитать(Форма)
	
	КомандаПересчитать = Форма.Команды.Добавить("Пересчитать");
	КомандаПересчитать.Заголовок = "Пересчитать";
	КомандаПересчитать.Действие = "Подключаемый_ДЗ11_2ПересчитатьСуммуСоСкидкой";
	
	КнопкаКоманды = Форма.Элементы.Добавить("КомандаПересчитать", Тип("КнопкаФормы"), Форма.Элементы.ГруппаПересчетСуммыСоСкидкой);
	КнопкаКоманды.ИмяКоманды = "Пересчитать";
	КнопкаКоманды.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	
КонецПроцедуры
//-- СогласованнаяСкидка
#КонецОбласти

#КонецЕсли
//-- СтудентНетология Зозуля Т.В. 31.01.2026